Revit 2026 API

# FailureDefinitionRegistry Class

---

The global registry for all FailureDefinitions in the Revit session.

SystemObject Autodesk.Revit.DBFailureDefinitionRegistry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FailureDefinitionRegistry : IDisposable
```
```vb
Public Class FailureDefinitionRegistry
	Implements IDisposable
```
```cpp
public ref class FailureDefinitionRegistry : IDisposable
```
```fsharp
type FailureDefinitionRegistry =
    class
        interface IDisposable
    end
```

The FailureDefinitionRegistry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FailureDefinitionRegistry |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | FindFailureDefinition | Finds a specific FailureDefinition by a given FailureDefinitionId. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ListAllFailureDefinitions | Retrieves all the registered FailureDefinitions. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

When a FailureDefinition is created, it will be registered in this registry automatically. Registration is allowed only during Revit Application startup - after that FailureDefinitionRegistry is locked and creation of new FailureDefinitions is not allowed. There is only one instance of FailureDefinitionRegistry in session. GetFailureDefinitionRegistry

#### Reference

Autodesk.Revit.DB Namespace